TestPlans/Car/Sure Thing! Max/xml/STM3_15102014_11.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <tns:aggregateQuoteRequest xmlns:tns="http://schemas.cdlis.co.uk/aggregator/api/v3-8">
      <userid>CTM</userid>
      <password>tys82HS63BjS</password>
      <broker results="1">hastings-dir</broker>
      <broker results="1">hastings-ess</broker>
      <broker results="1">igi3</broker>
      <broker results="1">onequote</broker>
      <broker results="1">elite</broker>
      <broker results="1">virgin</broker>
      <broker results="1">esurebroker</broker>
      <broker results="1">sheilasbroker</broker>
      <broker results="1">hastings-prem</broker>
      <broker results="1">hastings-peoples</broker>
      <broker results="1">selecter-oyd</broker>
      <broker results="1">sagaselect</broker>
      <broker results="1">smartmiles</broker>
      <broker results="1">castlecover-ageas50</broker>
      <broker results="1">surething</broker>
      <broker results="1">igo4asp-santander</broker>
      <broker results="1">igo4asp-renault</broker>
      <broker results="1">insurewiser</broker>
      <broker results="1">coverbox</broker>
      <broker results="1">drivestyle</broker>
      <broker results="1">sheilaswheelsmd</broker>
      <broker results="1">SureThing-Max</broker>
      <policyType>PC</policyType>
      <returnNoQuotes>Y</returnNoQuotes>
      <store>true</store>
      <risk xsi:type="tns:privateCarRiskType">
        <policy>
          <inceptionDate>2014-10-15</inceptionDate>
          <frequency>A</frequency>
          <protectedBonus>N</protectedBonus>
          <cover>C</cover>
          <volXS>0</volXS>
          <restrict>ND</restrict>
          <previousInsurance>
            <expiryDate>2014-10-15</expiryDate>
            <yearsHeld>0</yearsHeld>
            <type>PC</type>
            <noClaimsBonusYears>9</noClaimsBonusYears>
            <ncbProtected>N</ncbProtected>
          </previousInsurance>
          <totalMileage>4999</totalMileage>
          <classOfUse>SDP</classOfUse>
        </policy>
        <proposer driverId="1">
          <name>
            <title>Mr</title>
            <forenames>Keith</forenames>
            <surname>Eleven</surname>
          </name>
          <gender>M</gender>
          <dateOfBirth>1971-11-27</dateOfBirth>
          <maritalStatus>M</maritalStatus>
          <residentSince>1971-11-27</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>R</type>
            <occCode>R09</occCode>
            <empCode>186</empCode>
          </fullTimeOccupation>
          <conviction convictionId="1">
            <code>DR10</code>
            <date>2011-02-01</date>
            <points>0</points>
            <disqualification>0</disqualification>
            <fine>114</fine>
            <drinkReading>BR</drinkReading>
            <drinkReadingLevel>20</drinkReadingLevel>
          </conviction>
          <claim claimId="1">
            <code>C003</code>
            <date>2011-07-01</date>
            <cost>500.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>I</type>
            <date>1989-10-15</date>
          </licence>
          <vehicleUse>M</vehicleUse>
          <accessToOtherVehicles>NAOV</accessToOtherVehicles>
          <motoringOrg>NONE</motoringOrg>
          <smoker>Y</smoker>
          <address>
            <addressLine1>2 Duke of Edinburgh Way</addressLine1>
            <addressLine2>Malvern</addressLine2>
            <addressLine3></addressLine3>
            <addressLine4></addressLine4>
            <postCode>WR14 1AZ</postCode>
            <abodeType>H</abodeType>
          </address>
          <daytimeTelephone>01734320301</daytimeTelephone>
          <eveningTelephone>01734320301</eveningTelephone>
          <email>oliver.neal@emailreaction.org</email>
        </proposer>
        <driver driverId="2">
          <name>
            <title>Mr</title>
            <forenames>Karl</forenames>
            <surname>Eleven</surname>
          </name>
          <gender>M</gender>
          <dateOfBirth>1986-04-14</dateOfBirth>
          <maritalStatus>M</maritalStatus>
          <residentSince>2010-11-01</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>FTE</type>
            <occCode>49D</occCode>
            <empCode>186</empCode>
          </fullTimeOccupation>
          <licence>
            <type>I</type>
            <date>2010-10-15</date>
          </licence>
          <vehicleUse>F</vehicleUse>
          <accessToOtherVehicles>NAOV</accessToOtherVehicles>
          <relationshipToProposer>Si</relationshipToProposer>
        </driver>
        <vehicle>
          <regNumber>X779NBM</regNumber>
          <abiCode>52011702</abiCode>
          <yearOfManufacture>2000</yearOfManufacture>
          <whereKept>G</whereKept>
          <keeper>N</keeper>
          <owner>Other</owner>
          <purchased>2014-10-15</purchased>
          <value>2345</value>
          <paid>2345</paid>
          <vehicleOthers>0</vehicleOthers>
          <LHD>N</LHD>
          <ABS>N</ABS>
          <seats>5</seats>
          <modifications>
            <modified>N</modified>
          </modifications>
          <immob>FACT</immob>
          <alarm>FACT</alarm>
          <tracker>NONE</tracker>
        </vehicle>
        <duqs>
          <question number="11">Y</question>
          <question number="15">N</question>
          <question number="190">1989</question>
          <question number="266">M</question>
          <question number="40">HOME</question>
          <question number="579" />
          <question number="580"></question>
          <question number="578">N</question>
          <question number="282">I</question>
          <question number="527">Y</question>
          <question number="675">Y</question>
          <question number="544">N</question>
        </duqs>
      </risk>
      <brokerOptionalExtensions>
        <brokerOptionalExtension>
          <type>Premier Mandatory Bundle</type>
        </brokerOptionalExtension>
      </brokerOptionalExtensions>
    </tns:aggregateQuoteRequest>
  </soap:Body>
</soap:Envelope>